---
kind: property
id: P:Autodesk.Revit.DB.Visual.SolidGlass.SolidglassRefractionIor
source: html/e014aa26-8ab1-2be7-1e2e-046ad73f81a0.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass.SolidglassRefractionIor Property

The property labeled "Refraction" from the "SolidGlass" schema.

## Syntax (C#)
```csharp
public static string SolidglassRefractionIor { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0.01, 5".